# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи — первые буквы имён,
# значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


ls = ["Иван", "Мария", "Петр", "Марина", "Петр", "Алина", "Бибочка"]

def fio(ls: list) -> dict:
    result = {}
    for name in ls:
        if name[0] not in result:
            result[name[0]] = [name]
        else:
            result[name[0]].append(name)
    return result

def sort(ts):
    for key in sorted(ts):
        print(key, '=>', ts[key])

sort(fio(ls))





