# 4. * Функция принимает в качестве аргументов строки в формате «Имя Фамилия», возвращает словарь, ключи — первые буквы фамилий,
# значения — словари, реализованные по схеме предыдущего задания.
# in
# "Иван Сергеев", "Инна Серова", "Петр Алексеев",
# "Илья Иванов", "Анна Савельева", "Юнона Ветрякова",
# "Борис Аркадьев", "Антон Серов", "Павел Анисимов"
# out
# {'С': {'А': ['Анна Савельева', 'Антон Серов'], 'И': ['Иван Сергеев', 'Инна Серова']}, 'А': {'Б': ['Борис Аркадьев'], 'П':
# ['Павел Анисимов', 'Петр Алексеев']}, 'И': {'И': ['Илья Иванов']}, 'В': {'Ю': ['Юнона Ветрякова']}}

ls = ["Иван Сергеев", "Инна Серова", "Петр Алексеев", "Илья Иванов", "Анна Савельева", "Юнона Ветрякова",
         "Борис Аркадьев", "Антон Серов", "Павел Анисимов"]

def Fio(ls: list) -> dict:
    result = {}
    for fio in ls:
        name, second_name = str(fio).split()
        if second_name[0] in result:
            if name[0] in result[second_name[0]]:
                result[second_name[0]][name[0]].append(str(fio))
            else:
                result[second_name[0]][name[0]] = [fio]
        else:
            result[second_name[0]] = {name[0]: [fio]}
    return result

def sort(ts):
    rs = list(ts.keys())
    rs.sort()
    for key in ts:
        print(key, "=>", ts[key])

sort(Fio(ls))